Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector Class
 The AnalysisObjectSelector class contains methods for getting objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObjectSelector
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisObjectSelector
Public NotInheritable Class AnalysisObjectSelector
The AnalysisObjectSelector type exposes the following members.
Methods
Name | Description
GetAllObjects
 Returns an enumerator of all the model objects in the current model. NOT YET IMPLEMENTED.
GetAllObjectsWithType
 Returns an enumerator of all the model objects in the current model with the given type.
GetAnalysisModels
 Returns an enumerator of all the analysis model objects.
GetSelectedObjects
 Returns an enumerator of all the selected model objects in the current model. NOT YET IMPLEMENTED.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace